<?xml version="1.0" ?>
<net name="pose_detection_FP32" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,224,224"/>
			<output>
				<port id="0" names="input_1:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/reverse_input_channels15315/Concat15334_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,3,1,1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="input_1/reverse_input_channels15317/Concat15342_const" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="1,3,1,1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input_1/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="input_1/reverse_input_channels/Concat15326_const" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="24,3,3,3" size="2592"/>
			<output>
				<port id="0" names="Conv2D/filter:0" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv2D" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Add/y/EltwiseUnsqueeze7170_const" type="Const" version="opset1">
			<data element_type="f32" offset="2616" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" names="Add/y:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model_1/model/re_lu/Relu6_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu/Relu6_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="1604716050_const" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="24,1,1,3,3" size="864"/>
			<output>
				<port id="0" names="depthwise/filter_in:0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Add_1/y/EltwiseUnsqueeze7174_const" type="Const" version="opset1">
			<data element_type="f32" offset="3576" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" names="Add_1/y:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model_1/model/re_lu_1/Relu6_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_1/Relu6_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv2D_1/Transpose10186_const" type="Const" version="opset1">
			<data element_type="f32" offset="3672" shape="16,24,1,1" size="1536"/>
			<output>
				<port id="0" names="Conv2D_1/filter:0" precision="FP32">
					<dim>16</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv2D_1" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1/y/EltwiseUnsqueeze7178_const" type="Const" version="opset1">
			<data element_type="f32" offset="5208" shape="1,16,1,1" size="64"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1/y:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv2D_2/Transpose10190_const" type="Const" version="opset1">
			<data element_type="f32" offset="5272" shape="64,16,1,1" size="4096"/>
			<output>
				<port id="0" names="Conv2D_2/filter:0" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv2D_2" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_2:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Add_2/y/EltwiseUnsqueeze7182_const" type="Const" version="opset1">
			<data element_type="f32" offset="9368" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="Add_2/y:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_2:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model_1/model/re_lu_2/Relu6_model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_2/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_2/Relu6_model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_2/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="1603516038_const" type="Const" version="opset1">
			<data element_type="f32" offset="9624" shape="64,1,1,3,3" size="2304"/>
			<output>
				<port id="0" names="depthwise_1/filter_in:0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Add_3/y/EltwiseUnsqueeze7186_const" type="Const" version="opset1">
			<data element_type="f32" offset="11928" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="Add_3/y:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_3:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model_1/model/re_lu_3/Relu6_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_3/Relu6_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv2D_3/Transpose10198_const" type="Const" version="opset1">
			<data element_type="f32" offset="12184" shape="24,64,1,1" size="6144"/>
			<output>
				<port id="0" names="Conv2D_3/filter:0" precision="FP32">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv2D_3" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_3:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1/y/EltwiseUnsqueeze7190_const" type="Const" version="opset1">
			<data element_type="f32" offset="18328" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1/y:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv2D_4/Transpose10202_const" type="Const" version="opset1">
			<data element_type="f32" offset="18424" shape="144,24,1,1" size="13824"/>
			<output>
				<port id="0" names="Conv2D_4/filter:0" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv2D_4" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_4:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Add_4/y/EltwiseUnsqueeze7194_const" type="Const" version="opset1">
			<data element_type="f32" offset="32248" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" names="Add_4/y:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_4:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model_1/model/re_lu_4/Relu6_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_4/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_4/Relu6_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_4/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="1602716030_const" type="Const" version="opset1">
			<data element_type="f32" offset="32824" shape="144,1,1,3,3" size="5184"/>
			<output>
				<port id="0" names="depthwise_2/filter_in:0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="depthwise_2" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_2:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Add_5/y/EltwiseUnsqueeze7198_const" type="Const" version="opset1">
			<data element_type="f32" offset="38008" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" names="Add_5/y:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_5:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model_1/model/re_lu_5/Relu6_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_2/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_5/Relu6_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_2/depthwise:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv2D_5/Transpose10210_const" type="Const" version="opset1">
			<data element_type="f32" offset="38584" shape="24,144,1,1" size="13824"/>
			<output>
				<port id="0" names="Conv2D_5/filter:0" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv2D_5" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_5:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_5/Conv2D1/y/EltwiseUnsqueeze7202_const" type="Const" version="opset1">
			<data element_type="f32" offset="52408" shape="1,24,1,1" size="96"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_5/Conv2D1/y:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_5/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_5/Conv2D1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model_1/model/add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/add/add:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv2D_6/Transpose10214_const" type="Const" version="opset1">
			<data element_type="f32" offset="52504" shape="144,24,1,1" size="13824"/>
			<output>
				<port id="0" names="Conv2D_6/filter:0" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv2D_6" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_6:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Add_6/y/EltwiseUnsqueeze7206_const" type="Const" version="opset1">
			<data element_type="f32" offset="66328" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" names="Add_6/y:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_6:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model_1/model/re_lu_6/Relu6_model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_6/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_6/Relu6_model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_6/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="1601516018_const" type="Const" version="opset1">
			<data element_type="f32" offset="66904" shape="144,1,1,5,5" size="14400"/>
			<output>
				<port id="0" names="depthwise_3/filter_in:0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="depthwise_3" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="2,2" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_3:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Add_7/y/EltwiseUnsqueeze7210_const" type="Const" version="opset1">
			<data element_type="f32" offset="81304" shape="1,144,1,1" size="576"/>
			<output>
				<port id="0" names="Add_7/y:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Add_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_7:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model_1/model/re_lu_7/Relu6_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_7/Relu6_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv2D_7/Transpose10222_const" type="Const" version="opset1">
			<data element_type="f32" offset="81880" shape="40,144,1,1" size="23040"/>
			<output>
				<port id="0" names="Conv2D_7/filter:0" precision="FP32">
					<dim>40</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv2D_7" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_7:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1/y/EltwiseUnsqueeze7214_const" type="Const" version="opset1">
			<data element_type="f32" offset="104920" shape="1,40,1,1" size="160"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1/y:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv2D_8/Transpose10226_const" type="Const" version="opset1">
			<data element_type="f32" offset="105080" shape="240,40,1,1" size="38400"/>
			<output>
				<port id="0" names="Conv2D_8/filter:0" precision="FP32">
					<dim>240</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv2D_8" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_8:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Add_8/y/EltwiseUnsqueeze7218_const" type="Const" version="opset1">
			<data element_type="f32" offset="143480" shape="1,240,1,1" size="960"/>
			<output>
				<port id="0" names="Add_8/y:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_8:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model_1/model/re_lu_8/Relu6_model_1/model/batch_normalization_12/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/conv2d_8/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_8/Relu6_model_1/model/batch_normalization_12/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/conv2d_8/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="1608716090_const" type="Const" version="opset1">
			<data element_type="f32" offset="144440" shape="240,1,1,5,5" size="24000"/>
			<output>
				<port id="0" names="depthwise_4/filter_in:0" precision="FP32">
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="depthwise_4" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_4:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Add_9/y/EltwiseUnsqueeze7222_const" type="Const" version="opset1">
			<data element_type="f32" offset="168440" shape="1,240,1,1" size="960"/>
			<output>
				<port id="0" names="Add_9/y:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Add_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_9:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model_1/model/re_lu_9/Relu6_model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/depthwise_conv2d_4/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_9/Relu6_model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/depthwise_conv2d_4/depthwise:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv2D_9/Transpose10234_const" type="Const" version="opset1">
			<data element_type="f32" offset="169400" shape="40,240,1,1" size="38400"/>
			<output>
				<port id="0" names="Conv2D_9/filter:0" precision="FP32">
					<dim>40</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv2D_9" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_9:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model_1/model/batch_normalization_14/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_9/Conv2D1/y/EltwiseUnsqueeze7226_const" type="Const" version="opset1">
			<data element_type="f32" offset="207800" shape="1,40,1,1" size="160"/>
			<output>
				<port id="0" names="model_1/model/batch_normalization_14/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_9/Conv2D1/y:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model_1/model/batch_normalization_14/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_9/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/batch_normalization_14/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_9/Conv2D1:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model_1/model/add_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/add_1/add:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="1601916022_const" type="Const" version="opset1">
			<data element_type="f32" offset="207960" shape="40,1,1,3,3" size="1440"/>
			<output>
				<port id="0" names="depthwise_5/filter_in:0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="depthwise_5" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_5:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model_1/model/depthwise_conv2d_19/depthwise2/y/EltwiseUnsqueeze7230_const" type="Const" version="opset1">
			<data element_type="f32" offset="209400" shape="1,40,1,1" size="160"/>
			<output>
				<port id="0" names="model_1/model/depthwise_conv2d_19/depthwise2/y:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model_1/model/depthwise_conv2d_19/depthwise2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_1/model/depthwise_conv2d_19/depthwise2:0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv2D_11/Transpose10242_const" type="Const" version="opset1">
			<data element_type="f32" offset="209560" shape="96,40,1,1" size="15360"/>
			<output>
				<port id="0" names="Conv2D_11/filter:0" precision="FP32">
					<dim>96</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv2D_11" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_11:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Add_11/y/EltwiseUnsqueeze7234_const" type="Const" version="opset1">
			<data element_type="f32" offset="224920" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" names="Add_11/y:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Add_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_11:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model_1/model/activation_5/Relu_model_1/model/batch_normalization_52/FusedBatchNormV3_model_1/model/conv2d_36/Conv2D_model_1/model/conv2d_34/Conv2D" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/activation_5/Relu_model_1/model/batch_normalization_52/FusedBatchNormV3_model_1/model/conv2d_36/Conv2D_model_1/model/conv2d_34/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv2D_10/Transpose10246_const" type="Const" version="opset1">
			<data element_type="f32" offset="225304" shape="240,40,1,1" size="38400"/>
			<output>
				<port id="0" names="Conv2D_10/filter:0" precision="FP32">
					<dim>240</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv2D_10" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_10:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Add_10/y/EltwiseUnsqueeze7238_const" type="Const" version="opset1">
			<data element_type="f32" offset="263704" shape="1,240,1,1" size="960"/>
			<output>
				<port id="0" names="Add_10/y:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Add_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_10:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model_1/model/re_lu_10/Relu6_model_1/model/batch_normalization_15/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/conv2d_10/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_10/Relu6_model_1/model/batch_normalization_15/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/conv2d_10/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="1607116074_const" type="Const" version="opset1">
			<data element_type="f32" offset="264664" shape="240,1,1,3,3" size="8640"/>
			<output>
				<port id="0" names="depthwise_6/filter_in:0" precision="FP32">
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="depthwise_6" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_6:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Add_12/y/EltwiseUnsqueeze7242_const" type="Const" version="opset1">
			<data element_type="f32" offset="273304" shape="1,240,1,1" size="960"/>
			<output>
				<port id="0" names="Add_12/y:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Add_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_12:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="model_1/model/re_lu_11/Relu6_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model_1/model/re_lu_11/Relu6_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise:0" precision="FP32">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv2D_12/Transpose10254_const" type="Const" version="opset1">
			<data element_type="f32" offset="274264" shape="80,240,1,1" size="76800"/>
			<output>
				<port id="0" names="Conv2D_12/filter:0" precision="FP32">
					<dim>80</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv2D_12" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_12:0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>14</dim>
